leoadvance/nRF5_SDK/nRF5_SDK_for_Thread_and_Zigbee_v1.0.0/examples/multiprotocol/experimental/ble_zigbee_dynamic_light_switch_nus/main.c
        NRF_LOG_INFO("Found bulb addr: %d ep: %d", m_device_ctx.bulb_params.short_addr, m_device_ctx.bulb_params.endpoint);

        zb_err_code = ZB_SCHEDULE_ALARM_CANCEL(find_light_bulb_timeout, ZB_ALARM_ANY_PARAM);
        ZB_ERROR_CHECK(zb_err_code);

        bsp_board_led_on(BULB_FOUND_LED);
    }

    if (param)
    {
        ZB_FREE_BUF_BY_REF(param);
    }
}


/**@brief Function for sending ON/OFF and Level Control find request.
 *
 * @param[in]   param   Non-zero reference to ZigBee stack buffer that will be used to construct find request.
 */
static zb_void_t find_light_bulb(zb_uint8_t param)
{
    zb_buf_t                  * p_buf = ZB_BUF_FROM_REF(param); // Resolve buffer number to buffer address
    zb_zdo_match_desc_param_t * p_req;

    /* Initialize pointers inside buffer and reserve space for zb_zdo_match_desc_param_t request */
    UNUSED_RETURN_VALUE(ZB_BUF_INITIAL_ALLOC(p_buf, sizeof(zb_zdo_match_desc_param_t) + (1) * sizeof(zb_uint16_t), p_req));

    p_req->nwk_addr         = ZB_NWK_BROADCAST_RX_ON_WHEN_IDLE; // Send to all non-sleepy devices
    p_req->addr_of_interest = ZB_NWK_BROADCAST_RX_ON_WHEN_IDLE; // Get responses from all non-sleepy devices
    p_req->profile_id       = ZB_AF_HA_PROFILE_ID;              // Look for Home Automation profile clusters

    /* We are searching for 2 clusters: On/Off and Level Control Server */
    p_req->num_in_clusters  = 2;
    p_req->num_out_clusters = 0;
    p_req->cluster_list[0]  = ZB_ZCL_CLUSTER_ID_ON_OFF;
    p_req->cluster_list[1]  = ZB_ZCL_CLUSTER_ID_LEVEL_CONTROL;

    m_device_ctx.bulb_params.short_addr = 0x00; // Reset short address in order to parse only one response.
    UNUSED_RETURN_VALUE(zb_zdo_match_desc_req(param, find_light_bulb_cb));
}


/**@brief Finding procedure timeout handler.
 *
 * @param[in]   param   Reference to ZigBee stack buffer that will be used to construct find request.
 */
static zb_void_t find_light_bulb_timeout(zb_uint8_t param)
{
    zb_ret_t zb_err_code;

    if (param)
    {
        NRF_LOG_INFO("Bulb not found, try again");
        zb_err_code = ZB_SCHEDULE_ALARM(find_light_bulb, param, MATCH_DESC_REQ_START_DELAY);
        ZB_ERROR_CHECK(zb_err_code);
        zb_err_code = ZB_SCHEDULE_ALARM(find_light_bulb_timeout, 0, MATCH_DESC_REQ_TIMEOUT);
        ZB_ERROR_CHECK(zb_err_code);
    }
    else
    {
        zb_err_code = ZB_GET_OUT_BUF_DELAYED(find_light_bulb_timeout);
        ZB_ERROR_CHECK(zb_err_code);
    }
}


/**@brief Callback for detecting button press duration.
 *
 * @param[in]   button   BSP Button number that was pressed.
 */
static zb_void_t light_switch_button_handler(zb_uint8_t button)
{
    zb_time_t current_time;
    zb_bool_t short_expired;
    zb_bool_t on_off;
    zb_ret_t  zb_err_code;

    current_time = ZB_TIMER_GET();

    if (button == LIGHT_SWITCH_BUTTON_ON)
    {
        on_off = ZB_TRUE;
    }
    else
    {
        on_off = ZB_FALSE;
    }

    if (ZB_TIME_SUBTRACT(current_time, m_device_ctx.button.timestamp) > LIGHT_SWITCH_BUTTON_THRESHOLD)
    {
        short_expired = ZB_TRUE;
    }
    else
    {
        short_expired = ZB_FALSE;
    }

    /* Check if button was released during LIGHT_SWITCH_BUTTON_SHORT_POLL_TMO. */
    if (nrf_drv_gpiote_in_is_set(bsp_board_button_idx_to_pin(button)))
    {
        if (!short_expired)
        {
            /* Allocate output buffer and send on/off command. */
            zb_err_code = ZB_GET_OUT_BUF_DELAYED2(light_switch_send_on_off, on_off);
            ZB_ERROR_CHECK(zb_err_code);
        }

        /* Button released - wait for accept next event. */
        m_device_ctx.button.in_progress = ZB_FALSE;
    }
    else
    {
        if (short_expired)
        {
            /* The button is still pressed - allocate output buffer and send step command. */
            zb_err_code = ZB_GET_OUT_BUF_DELAYED2(light_switch_send_step, on_off);
            ZB_ERROR_CHECK(zb_err_code);
            zb_err_code = ZB_SCHEDULE_ALARM(light_switch_button_handler, button, LIGHT_SWITCH_BUTTON_LONG_POLL_TMO);
            ZB_ERROR_CHECK(zb_err_code);
        }
        else
        {
            /* Wait another LIGHT_SWITCH_BUTTON_SHORT_POLL_TMO, until LIGHT_SWITCH_BUTTON_THRESHOLD will be reached. */
            zb_err_code = ZB_SCHEDULE_ALARM(light_switch_button_handler, button, LIGHT_SWITCH_BUTTON_SHORT_POLL_TMO);
            ZB_ERROR_CHECK(zb_err_code);
        }
    }
}


/**@brief Callback for button events.
 *
 * @param[in]   pin      Pin that triggered this event.
 * @param[in]   action   Action that lead to triggering this event.
 */
static void buttons_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    uint32_t button = bsp_board_pin_to_button_idx(pin);
    zb_ret_t zb_err_code;

    if (action != GPIOTE_CONFIG_POLARITY_HiToLo)
    {
        return;
    }

    if (!m_device_ctx.bulb_params.short_addr)
    {
      return;
    }

    if (!m_device_ctx.button.in_progress)
    {
        m_device_ctx.button.in_progress = ZB_TRUE;
        m_device_ctx.button.timestamp = ZB_TIMER_GET();

        zb_err_code = ZB_SCHEDULE_ALARM(light_switch_button_handler, button, LIGHT_SWITCH_BUTTON_SHORT_POLL_TMO);
        ZB_ERROR_CHECK(zb_err_code);
    }
}


/**@brief Function for initializing LEDs and buttons.
 */
static void leds_buttons_init(void)
{
    nrf_drv_gpiote_in_config_t buttons_config = GPIOTE_CONFIG_IN_SENSE_HITOLO(true);
    uint32_t                   error_code;

    /* Initialize LEDs - use bsp_board to control them. */
    error_code = bsp_init(BSP_INIT_LEDS, NULL);
    APP_ERROR_CHECK(error_code);

    bsp_board_leds_off();

    /* Initialize buttons - use nrf_drv_gpioto directly to enable interrupts. */
    error_code = nrf_drv_gpiote_init();
    APP_ERROR_CHECK(error_code);

    buttons_config.pull = NRF_GPIO_PIN_PULLUP;
    error_code = nrf_drv_gpiote_in_init(bsp_board_button_idx_to_pin(LIGHT_SWITCH_BUTTON_ON), &buttons_config, buttons_handler);
    APP_ERROR_CHECK(error_code);
    nrf_drv_gpiote_in_event_enable(bsp_board_button_idx_to_pin(LIGHT_SWITCH_BUTTON_ON), true);

    error_code = nrf_drv_gpiote_in_init(bsp_board_button_idx_to_pin(LIGHT_SWITCH_BUTTON_OFF), &buttons_config, buttons_handler);
    APP_ERROR_CHECK(error_code);
    nrf_drv_gpiote_in_event_enable(bsp_board_button_idx_to_pin(LIGHT_SWITCH_BUTTON_OFF), true);
}

/**@brief Function for handling commands received from the Nordic UART Service.
 *
 * @details This function will check received data agains predefined commands and
 *          generate a corresponding Zigbee request upon successfull match.
 *
 * @param[in] p_command_str  Command string received over UART.
 * @param[in] length         Length of the data.
 */
static void zigbee_command_handler(const uint8_t * p_command_str, uint16_t length)
{
    ret_code_t err_code;
    int32_t    delay;

    /* If Ligh bulb is not found - do not send requests. */
    if (!m_device_ctx.bulb_params.short_addr)
    {
        return;
    }

    if (strncmp(COMMAND_ON, (char *)p_command_str, strlen(COMMAND_ON)) == 0)
    {
        ZB_GET_OUT_BUF_DELAYED2(light_switch_send_on_off, 1);
    }
    else if (strncmp(COMMAND_OFF, (char *)p_command_str, strlen(COMMAND_OFF)) == 0)
    {
        ZB_GET_OUT_BUF_DELAYED2(light_switch_send_on_off, 0);
    }
    else if (strncmp(COMMAND_TOGGLE, (char *)p_command_str, strlen(COMMAND_TOGGLE)) == 0)
    {
        ZB_GET_OUT_BUF_DELAYED(light_switch_send_toggle);
    }
    else if (strncmp(COMMAND_INCREASE, (char *)p_command_str, strlen(COMMAND_INCREASE)) == 0)
    {
        ZB_GET_OUT_BUF_DELAYED2(light_switch_send_step, 1);
    }
    else if (strncmp(COMMAND_DECRESE, (char *)p_command_str, strlen(COMMAND_DECRESE)) == 0)
    {
        ZB_GET_OUT_BUF_DELAYED2(light_switch_send_step, 0);
    }
    else if (length < 4)
    {
        delay = strtol((const char *)p_command_str, NULL, 10);

        /* Check for parsing errors. */
        if ((delay == 0) && ((length != 1) || (p_command_str[0] != '0')))
        {
            NRF_LOG_INFO("Unrecognized UART command received:");
            NRF_LOG_HEXDUMP_INFO(p_command_str, length);
            return;
        }

